; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v4)
		(pred_1 ?v1)
		(pred_6 ?v8)
		(pred_2 ?v8)
		(pred_5 ?v1 ?v8)
		(pred_3)
		(pred_4 ?v1))

   (:action op_3
       :parameters  (?v7 ?v3)
       :precondition (and (not-eq ?v7 ?v3) 
                          (pred_6 ?v7) (pred_6 ?v3) (pred_2 ?v7))
       :effect (and  (pred_2 ?v3)
		     (not (pred_2 ?v7))))


   (:action op_2
       :parameters (?v2 ?v5)
       :precondition  (and  (pred_1 ?v2) (pred_6 ?v5)
			    (pred_5 ?v2 ?v5) (pred_2 ?v5) (pred_3))
       :effect (and (pred_4 ?v2)
		    (not (pred_5 ?v2 ?v5)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v2  ?v5)
       :precondition  (and  (pred_1 ?v2) (pred_6 ?v5)
			    (pred_4 ?v2) (pred_2 ?v5))
       :effect (and (pred_5 ?v2 ?v5)
		    (pred_3)
		    (not (pred_4 ?v2)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_05 obj_01 obj_04 
          obj_03 obj_06 obj_02 
)
(:init
(pred_6 obj_05)
(pred_6 obj_01)
(pred_6 obj_04)
(pred_1 obj_03)
(pred_1 obj_06)
(pred_1 obj_02)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_3)
(pred_5 obj_03 obj_05)
(pred_5 obj_06 obj_04)
(pred_5 obj_02 obj_01)
(pred_2 obj_04)
)
(:goal
(and
(pred_5 obj_03 obj_04)
(pred_5 obj_06 obj_05)
(pred_5 obj_02 obj_01)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_03 obj_04) (pred_2 obj_01))
    (sometime-before  (pred_5 obj_06 obj_05) (pred_2 obj_01))
  )
)
)

; plan
1. (op_2 obj_06 obj_04)
   deleted: (pred_5 obj_06 obj_04) (pred_3)
   added: (pred_4 obj_06)
   goals met: 1 of 3
2. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 1 of 3
3. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_5 obj_06 obj_01) (pred_3)
   goals met: 1 of 3
4. (op_3 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_05)
   goals met: 1 of 3
5. (op_2 obj_03 obj_05)
   deleted: (pred_5 obj_03 obj_05) (pred_3)
   added: (pred_4 obj_03)
   goals met: 1 of 3
6. (op_3 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_04)
   goals met: 1 of 3
7. (op_1 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_5 obj_03 obj_04) (pred_3)
   goals met: 2 of 3
8. (op_3 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 2 of 3
9. (op_2 obj_06 obj_01)
   deleted: (pred_5 obj_06 obj_01) (pred_3)
   added: (pred_4 obj_06)
   goals met: 2 of 3
10. (op_3 obj_01 obj_05)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_05)
   goals met: 2 of 3
11. (op_1 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_5 obj_06 obj_05) (pred_3)
   goals met: 3 of 3
